app/controllers/quotes_controller.rb

  def index
    @quote = Quote.order("RANDOM()").first
---
SELECT  "quotes".* FROM "quotes" ORDER BY "quotes"."id" ASC LIMIT $1  [["LIMIT", 1]]

def create
  @quote = Quote.create(quote_params)
---
INSERT INTO "quotes" ("saying", "author", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["saying", "You miss 100% of the shots you don't take"], ["author", "Wayne Gretzky"], ["created_at", "2017-06-15 05:11:11.001270"], ["updated_at", "2017-06-15 05:11:11.001270"]]